## Books

### Author:  Sheneka Allen

In [ ]:
# Insert books_ERD image in notebook

![png](Data/books_ERD.png)

In [2]:
import pandas as pd
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
username = 'root'
password = 'pwd'

connection = "mysql+pymysql://{username}:{password}@localhost/books"
engine = create_engine(connection)

In [3]:
from urllib.parse import quote_plus as urlquote

# from sqlalchemy.engine import create_engine, need quote_plus lib for special char in pwd

connection = f'mysql+pymysql://{username}:{urlquote(password)}@localhost/books'
engine = create_engine(connection)

In [4]:
# create database books
create_database(connection)

In [5]:
# verify database was created by PyMySQL
database_exists(connection)

True

In [6]:
# Now that we have created our books database, 
# we are going to add tables to it using pandas dataframes.

# upload users table
df = pd.read_csv('data/users.csv')
df.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [7]:
# upload users dataframe to books db
df.to_sql('users', engine, if_exists = 'replace')

In [8]:
# upload books table
df1 = pd.read_csv('data/books.csv')
df1.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [9]:
# upload books dataframe to books db
df1.to_sql('books', engine, if_exists = 'replace')

In [18]:
# upload authors table
df2 = pd.read_csv('data/authors.csv')
df2.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [19]:
# upload authors dataframe to books db
df2.to_sql('authors', engine, if_exists = 'replace')

In [20]:
# upload favorites table
df3 = pd.read_csv('data/favorites.csv')
df3.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [21]:
# upload favorites dataframe to books db
df3.to_sql('favorites', engine, if_exists = 'replace')

In [14]:
# verify PyMySQL comms, read from tables in books db
q = """SELECT * FROM books LIMIT 2;"""
pd.read_sql(q, engine)

   index  id        title  author_id
0      0   1  The Shining          1
1      1   2           It          1

In [22]:
# show all tables in books db
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [24]:
q = """SELECT 
    books.title, favorites.user_id
FROM
    books
        JOIN
    favorites ON books.id = favorites.book_id
WHERE
    favorites.user_id = (SELECT 
            users.id
        FROM
            users
        WHERE
            (users.last_name = 'Doe'
                AND users.first_name = 'John'));"""
pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1